1. SERIES WITH LABELS

In [1]:
import pandas as pd

s = pd.Series([10, 12, 30], index=['a', 'b', 'c'])
print(s)

a    10
b    12
c    30
dtype: int64

2. DATAFRAME (2D)

In [15]:
import pandas as pd

data = {
    "Name": [ "Joseph", "Asha", "John", "Fatma", "Kelvin",  "Sarah", "Said", "Neema", "Juma", "Anna"],
    "Age": [ 23, 26, 25, 28, 22,  24, 30, 26, 29, 27],
    "City": [ "Dar", "Mwanza", "Mwanza", "Dodoma", "Tanga",  "Mbeya", "Zanzibar", "Iringa", "Morogoro", "Tabora"],
    "Profession": [ "Engineer", "Doctor", "Artist", "Teacher", "Developer",  "Pilot", "Chef", "Nurse", "Accountant", "Lawyer"]
}
df = pd.DataFrame(data)
df

     Name  Age      City  Profession
0  Joseph   23       Dar    Engineer
1    Asha   26    Mwanza      Doctor
2    John   25    Mwanza      Artist
3   Fatma   28    Dodoma     Teacher
4  Kelvin   22     Tanga   Developer
5   Sarah   24     Mbeya       Pilot
6    Said   30  Zanzibar        Chef
7   Neema   26    Iringa       Nurse
8    Juma   29  Morogoro  Accountant
9    Anna   27    Tabora      Lawyer

3. SELECTING DATA

In [12]:
df['Name'] #select one column

0    Joseph
1      Asha
2      John
3     Fatma
4    Kelvin
5     Sarah
6      Said
Name: Name, dtype: object

In [13]:
df[['Name', 'City']] #select multiple columns

     Name      City
0  Joseph       Dar
1    Asha    Arusha
2    John    Mwanza
3   Fatma    Dodoma
4  Kelvin     Tanga
5   Sarah     Mbeya
6    Said  Zanzibar

In [18]:
df.loc[6]

Name              Said
Age                 30
City          Zanzibar
Profession        Chef
Name: 6, dtype: object

4. FILTERING DATA

In [16]:
df[df['Age'] > 24]

    Name  Age      City  Profession
1   Asha   26    Mwanza      Doctor
2   John   25    Mwanza      Artist
3  Fatma   28    Dodoma     Teacher
6   Said   30  Zanzibar        Chef
7  Neema   26    Iringa       Nurse
8   Juma   29  Morogoro  Accountant
9   Anna   27    Tabora      Lawyer

In [17]:
df[(df['Age'] > 24) & (df['City'] == 'Dar')]

Empty DataFrame
Columns: [Name, Age, City, Profession]
Index: []

5. ADDING & MODIFYING COLUMNS

In [72]:
df['salary'] = [500000, 600000, 550000, 500000, 600000, 550000, 500000, 600000, 550000, 545454]
df.head() #first 5 rows

     Name  Age    City Profession  salary
0  Joseph   23     Dar   Engineer  500000
1    Asha   26  Mwanza     Doctor  600000
2    John   25  Mwanza     Artist  550000
3   Fatma   28  Dodoma    Teacher  500000
4  Kelvin   22   Tanga  Developer  600000

In [62]:
df['Age'] = df['Age'] + 1 # will keep updating for every execution
df.tail()

    Name  Age      City  Profession  salary
5  Sarah   25     Mbeya       Pilot  550000
6   Said   31  Zanzibar        Chef  500000
7  Neema   27    Iringa       Nurse  600000
8   Juma   30  Morogoro  Accountant  550000
9   Anna   28    Tabora      Lawyer  545454

6. REMOVING DATA

In [67]:
df.drop('salary', axis=1, inplace=True) #remove column
df.head()

     Name  Age    City Profession
0  Joseph   24     Dar   Engineer
1    Asha   27  Mwanza     Doctor
2    John   26  Mwanza     Artist
3   Fatma   29  Dodoma    Teacher
4  Kelvin   23   Tanga  Developer

In [74]:
df.drop(1, axis=0, inplace=True)
df

     Name  Age      City  Profession  salary
0  Joseph   23       Dar    Engineer  500000
2    John   25    Mwanza      Artist  550000
3   Fatma   28    Dodoma     Teacher  500000
4  Kelvin   22     Tanga   Developer  600000
5   Sarah   24     Mbeya       Pilot  550000
6    Said   30  Zanzibar        Chef  500000
7   Neema   26    Iringa       Nurse  600000
8    Juma   29  Morogoro  Accountant  550000
9    Anna   27    Tabora      Lawyer  545454

7. READING & WRITING FILES

In [94]:
df = pd.read_csv('customers-1000.csv')
df.shape

(1000, 12)

In [97]:
df.columns

Index(['Index', 'Customer Id', 'First Name', 'Last Name', 'Company', 'City',
       'Country', 'Phone 1', 'Phone 2', 'Email', 'Subscription Date',
       'Website'],
      dtype='object')

In [107]:
df.loc[df['Country'] == "China", ['First Name', 'Last Name', 'Country', 'Company', 'Subscription Date']]

    First Name Last Name Country                     Company Subscription Date
2        Jenna   Harding   China                Bailey Group        2020-04-05
60       Bruce      Bass   China   Day, Wiley and Mclaughlin        2020-08-10
93         Don     Henry   China    Giles, Kerr and Stafford        2020-10-18
94      Dakota    Bowman   China                 Gomez-Tapia        2022-04-17
281     Isaiah   Buckley   China                Davies-Hardy        2021-01-19
515     Andrea    Dennis   China                  Kramer Ltd        2020-12-16
757     Connie   Mercado   China   Weeks, Perez and Andersen        2022-02-13
764       Sean      Gray   China                Larsen-Payne        2022-05-21
917     Leslie   Spencer   China  French, Estrada and Decker        2021-11-30

In [ ]:
chinaCustomers = df.loc[df['Country'] == "China", ['First Name', 'Last Name', 'Country', 'Company', 'Subscription Date']]
chinaCustomers.to_csv('China-Cutomers.csv', index=False) # creating new csv file for china customers

In [12]:
df = pd.read_csv('China-Cutomers.csv')
df.shape

(9, 5)

In [110]:
df

  First Name Last Name Country                     Company Subscription Date
0      Jenna   Harding   China                Bailey Group        2020-04-05
1      Bruce      Bass   China   Day, Wiley and Mclaughlin        2020-08-10
2        Don     Henry   China    Giles, Kerr and Stafford        2020-10-18
3     Dakota    Bowman   China                 Gomez-Tapia        2022-04-17
4     Isaiah   Buckley   China                Davies-Hardy        2021-01-19
5     Andrea    Dennis   China                  Kramer Ltd        2020-12-16
6     Connie   Mercado   China   Weeks, Perez and Andersen        2022-02-13
7       Sean      Gray   China                Larsen-Payne        2022-05-21
8     Leslie   Spencer   China  French, Estrada and Decker        2021-11-30

7.1: READING excel file (xlsx)

In [8]:
df = pd.read_excel('sample-data.xlsx')
print("Dimensions: ", df.shape)
df.head()

Dimensions:  (100, 8)

   0 First Name  Last Name  Gender        Country  Age        Date    Id
0  1      Dulce      Abril  Female  United States   32  15/10/2017  1562
1  2       Mara  Hashimoto  Female  Great Britain   25  16/08/2016  1582
2  3     Philip       Gent    Male         France   36  21/05/2015  2587
3  4   Kathleen     Hanner  Female  United States   25  15/10/2017  3549
4  5    Nereida    Magwood  Female  United States   58  16/08/2016  2468

8. SORTING

In [11]:
df.sort_values(by='Age')
df.head()

   0 First Name  Last Name  Gender        Country  Age        Date    Id
0  1      Dulce      Abril  Female  United States   32  15/10/2017  1562
1  2       Mara  Hashimoto  Female  Great Britain   25  16/08/2016  1582
2  3     Philip       Gent    Male         France   36  21/05/2015  2587
3  4   Kathleen     Hanner  Female  United States   25  15/10/2017  3549
4  5    Nereida    Magwood  Female  United States   58  16/08/2016  2468